/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "操作を完了できませんでした";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "原因不明のエラーが起きました（%d）"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "操作を完了できません";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "後でやり直してください。";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "収録できません";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "もう一度収録してください。";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "収録できません";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "%@を使用しているほかの操作をすべて停止してやり直してください。"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "収録できません";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "もう一度収録してください。";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "収録が停止されました";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "もう一度収録してください。";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "操作を中止しました";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "十分な空き領域がないため、ファイルへの書き込みを続行できません。既存のビデオや写真を削除して、
空き領域を増やしてください。";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "収録が停止されました";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "もう一度収録してください。";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "収録が停止されました";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "もう一度収録してください。";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "収録が停止されました";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "収録可能な長さの上限に達しました。"; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "収録が停止されました";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "収録可能なファイルサイズの上限に達しました。"; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "収録が停止されました";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "収録デバイスを使用しているほかの操作をすべて停止してやり直してください。";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "収録が停止されました";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "収録可能な長さの上限に達しました。"; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "収録できません";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "もう一度収録してください。";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "%@を使用できません"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "%@を使用しているほかの操作をすべて停止してやり直してください。"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "%@を使用できません"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "%@を使用しているほかの操作をすべて停止してやり直してください。"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "収録が停止されました";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "収録デバイスを使用しているほかの操作をすべて停止してやり直してください。";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "LEDライトをオンにできませんでした。";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "レベルを下げてLEDライトをオンにしてみてください。";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "操作を完了できません";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "後でやり直してください。";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "書き出しを完了できません";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "もう一度書き出してください。";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "デコードできません";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "このメディアデータはデコードできませんでした。壊れている可能性があります。";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "開けません";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "このメディア形式には対応していません。";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "保存できません";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "もう一度保存してください。";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "出力ファイルを書き出せません";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "出力ファイルの拡張子を変更してからやり直してください。";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "開けません";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "このメディアは使用できません。";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "開けません";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "このメディアは使用できません。";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "開けません";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "このメディアは使用できません。";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "開けません";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "このメディアは使用できません。";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "開けません";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "このメディア形式には対応していません。";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "開けません";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "このメディアは壊れている可能性があります。";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "写真を撮れません";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "もう一度写真を撮ってみてください。";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "操作を中止しました";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "この操作は、保護されたコンテンツではサポートされていません"; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "開けません";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "このコンテンツは認証されていません。"; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "開けません";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "このAppでこのファイルを再生することは認証されていません。"; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "開けません";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "このメディアは使用できません。";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "デコードできません";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "このメディアに必要なデコーダが見つかりません。";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "エンコードできません";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "このメディアに必要なエンコーダが見つかりません。";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "デコードできません";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "このメディアに必要なデコーダをほかの操作が使用中です。";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "メディアをデコードするほかの操作をすべて停止してからやり直してください。";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "エンコードできません";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "このメディアに必要なエンコーダをほかの操作が使用中です。";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "メディアをエンコードするほかの操作をすべて停止してからやり直してください。";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "%@を使用できません"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "%@は
バックグラウンドで
別のAppが使用している
可能性があります。"; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "操作を中止しました";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "この操作は、このメディアではサポートされていません。";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "操作を中止しました";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "指示通りにビデオを
作成できませんでした。";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "開けません";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "このメディアは使用できません。";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "操作を中止しました";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "ダウンロード先URLのキャッシュファイルを使用できません。";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "操作を中止しました";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "このファイルには無効なチェックサムが含まれています。";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "操作は中断されました";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "ほかの操作を中止してからやり直してください。";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "開けません";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "このメディアはこのデバイスでは使用できません。";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "操作を中止しました";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "このメディアは壊れている可能性があります。";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "操作を中止しました";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "サーバが正しく構成されていません。";
